**free
/INCLUDE "/home/ROLAND/builds/KnowledgeSharing/QRPGLESRC/a_h.rpgle"

shared_variable = 'abcde';
if (shared_variabe = '12345');
   // some logic
endif;